
Vue.component('MainColor', {
  template: `
<div>
 



<div class="Info_colors">
 


<div class="info-block">
  <div class="color-pict">
    <div class="red-block"></div>
    <div class="red-pict"></div>
</div>

  <div class="info-text"> 
      <h2><font color=#b04343>Культура</font></h2>
      <div class="line"></div>
      <p>Культура является важнейшим аспектом подсознательного восприятия цвета, поэтому очень важно понимать культуру цвета вашей целевой аудитории. Так, например, жёлтый цвет в Индии символизирует великолепие и сияние, в то время как для сирийских мусульман жёлтый - символ смерти. Таким образом можно рассуждать про все цвета т.к. во всех наиболее развитых народах было принято придавать цветам особые значения, которые появлялись благодоря религиозному, историческому и социальному контекстуам. Для успешного продвижения своей продукции нужно изучить культурный аспект выбранного цвета в стране, которая является целевой.
                    Для вашего удобства мы подготовили разбор восприятия основных цветов относительно различных культур. Для того, чтобы просмотреть эту информацию, кликните на интересующий вас цвет.Панель с цветами находится выше.</p>
</div>
</div>


<div class="info-block">
<div class="info-text"> 
<h2><font color=#6789a3>Возраст</font></h2>
<div class="line"></div>
<p>Не менее важным является возраст целевой категории. Люди разных возрастов предпочитают разные цветовые решения. Отличия в них не являются слишком большими, но, тем не менее, имеют значение. Психологами установлено, что до 20-ти лет
именно красный цвет чаще остальных
ставится на первое место по
предпочтительности. По Люшеру, юноши,
достигшие половой зрелости отдают свое
предпочтение красно-оранжевому цвету. К
30 годам наблюдается небольшой спад, и
красный цвет несколько реже оказывается на
первом месте, ак 60 годам этот цвет занимает
место в середине или ближе к концу
цветового ряда предпочтений. В настоящее время нет цветов, строго
закрепленных за определенной возрастной
категорией, однако есть цвета или комбинации
цветов, присущие той или иной груп
пе. 
 цвета можно
подразделить на две группы: первая –
«жизненные/молодые» цвета, которые
заключают в себе силу, энергию, действие,
жизнь. К этой группе относятся розовый,
красный, желтый, оранжевый, белый, яркие
оттенки зеленого, синего и пастельные
цвета. Вторая группа – это «увядающие/старческие» цвета, символизирующие значительное снижение жизненной активности. Так, например, коричневый ассоциируется, прежде всего, с
процессом гниения, либо конечной стадией
увядшей растительности; фиолетовый/сиреневый – это активность красного,
подавленная пассивностью синего, так же
символизирует утрату энергии, увядание,
старение. 
</p>
</div>
  <div class="color-pict">
    <div class="blue-block"></div>
    <div class="blue-pict"></div>
</div>
</div>





<div class="info-block block-green">
  <div class="color-pict">
    <div class="green-block"></div>
    <div class="green-pict"></div>
</div>

  <div class="info-text"> 
      <h2><font color=#649772>Ассоциации</font></h2>
      <div class="line"></div>
      <p>Важно понимать, что смотря на цвет человек начинает испытывать различные эмоции, видеть картинки, ассоциирующиеся у него с этим цветом.</p>
</div>
</div>

<div class="Section">
        <div class="Men_Wo">
            <div class="men sex">
                <h2>Мужчины</h2>
                <p>Мужчины обращают внимание преимущественно на яркие и чистые цвета, игнорируя оттенки. Например, из вариаций одного цвета мужчины выберут зеленый; представители сильного пола предпочтут красный. Мужчины предпочитают монохромность или сочетание цветов, расположенных в спектре рядом. А еще для них привлекательны черный и оттенки серого. Мужчины намного меньше, чем женщины, придают значение цвету как характеристике вещи.
                </p>
                <div class="color_line m"></div>
            </div>
            <div class="v_line"></div>
            <div class="women sex">
                <h2>Женщины</h2>
                <p>Для женщин, наоборот, именно оттенки важнее и интереснее. Например, из вариаций одного женщины выберут – салатовый, дамы обратят внимание на бордовый. Женщины более серьезно относятся к подбору цветов и их сочетаемости и более чувствительны к явлению цветовой гармонии, выбирая сочетания дополнительных цветов.    </p>
                <div class="color_line w"></div>
            </div>

        </div>

<div class="Section">

  <div class="amount"> 
 
        <h2>Количество цветов</h2>
        
       
       
        <p> 
        Цвета, используемые на сайте, действительно влияют на удовлетворенность и доверие пользователей. Более того, использование контрастных цветов положительно отражалось на читательских способностях пользователей и помогало им лучше ориентироваться на сайте. Отсутствие контраста затрудняет чтение и распознавание контента. Слишком много разных цветов выглядят перегруженными, навязчивыми и быстро отпугивают пользователей. Тщательно отобранные и используемые с пользой, они могут подсознательно дать пользователю первое впечатление о компании еще до того, как он что-то прочитает. Существуют множество вариантов сочетания и согласования разных цветов друг с другом. Грамотный подбор цветов пользователям запомнить ваш сайт.
        Обычно для проекта достаточно пять цветов. Три из них основные, а два остальных дополнительные. Основные цвета в свою очередь делятся на светлый, тёмный и акцидентный (обычно яркий). В дополнительные цвета входят сближенные оттенки.
        Если же говорить о соотношении, то в качестве отправной точки можно взять правило 60-30-10, которое на протяжении многих лет используется в интерьере и моде, и одинаково хорошо работает и в веб-дизайне. Согласно этому правилу, используются три разных цвета, в сочетании 60%, 30% и 10% соответственно:
        <br>* 60% будет основным цветом вашего сайта и задавать общий фон;
        <br>* 30% должны контрастировать с 60%, чтобы создать визуально приятный эффект;
        <br>* 10% является цветовым акцентом, который должен дополнять первый или второй основной цвет.
        
        </p>
        
        <img class="y" src="../images/leaves5.png " alt="">
  </div>
</div>

</div>
</div>

</div>
`
});